go-profiling-toolchain/e5-pyroscope-overhead/output/run1-cpu-monitoring-broken/agent-hey.log

Summary:
  Total:	60.0009 secs
  Slowest:	0.0151 secs
  Fastest:	0.0001 secs
  Average:	0.0018 secs
  Requests/sec:	45113.7809
  
  Total data:	8120607 bytes
  Size/request:	8 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [998771]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [1085]	|
  0.005 [83]	|
  0.006 [9]	|
  0.008 [38]	|
  0.009 [11]	|
  0.011 [0]	|
  0.012 [0]	|
  0.014 [0]	|
  0.015 [2]	|


Latency distribution:
  10%% in 0.0006 secs
  25%% in 0.0006 secs
  50%% in 0.0007 secs
  75%% in 0.0007 secs
  90%% in 0.0007 secs
  95%% in 0.0008 secs
  99%% in 0.0010 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0047 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0016 secs
  resp wait:	0.0018 secs, 0.0001 secs, 0.0151 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0026 secs

Status code distribution:
  [200]	1000000 responses