go-profiling-toolchain/e5-pyroscope-overhead/output/run1-cpu-monitoring-broken/baseline-hey.log

Summary:
  Total:	60.0007 secs
  Slowest:	0.0105 secs
  Fastest:	0.0001 secs
  Average:	0.0018 secs
  Requests/sec:	45430.3654
  
  Total data:	8177556 bytes
  Size/request:	8 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [996466]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [3241]	|
  0.003 [224]	|
  0.004 [35]	|
  0.005 [3]	|
  0.006 [0]	|
  0.007 [1]	|
  0.008 [3]	|
  0.009 [17]	|
  0.011 [9]	|


Latency distribution:
  10%% in 0.0006 secs
  25%% in 0.0006 secs
  50%% in 0.0007 secs
  75%% in 0.0007 secs
  90%% in 0.0007 secs
  95%% in 0.0007 secs
  99%% in 0.0009 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0056 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0021 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0011 secs
  resp wait:	0.0018 secs, 0.0001 secs, 0.0043 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0013 secs

Status code distribution:
  [200]	1000000 responses